---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCConnectedWallData
source: html/a76bcc95-1db6-3b5c-3ac4-583af15517b9.htm
---
# Autodesk.Revit.DB.IFC.IFCConnectedWallData

A class that contains the IFC-specific information about how an element is joined to another element.

## Syntax (C#)
```csharp
public class IFCConnectedWallData : IDisposable
```